## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.argocd.module.argocd_server.kubernetes_ingress.argocd_ingress_route[0] will be created
+   resource "kubernetes_ingress" "argocd_ingress_route" {
+       id     = (known after apply)
+       status = (known after apply)

+       metadata {
+           annotations      = {
+               "cert-manager.io/cluster-issuer" = "ZeroSSL"
+               "kubernetes.io/ingress.class"    = "istio"
            }
+           generation       = (known after apply)
+           labels           = {
+               "app.kubernetes.io/component" = "server"
+               "app.kubernetes.io/part-of"   = "argocd"
            }
+           name             = "argocd-server"
+           namespace        = "kube-argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           ingress_class_name = "ingress"

+           rule {
+               host = "argocd.wayofthesys.org"

+               http {
+                   path {
+                       path = "/"

+                       backend {
+                           service_name = "argocd-server"
+                           service_port = "443"
                        }
                    }
                }
            }

+           tls {
+               hosts       = [
+                   "argocd.wayofthesys.org",
                ]
+               secret_name = "argocd-ingress-tls"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
